---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Entity.#ctor
source: html/d1743969-c148-f03e-b51f-6903fc28bbd2.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Entity.#ctor Method

The default-constructed Entity is invalid.

## Syntax (C#)
```csharp
public Entity()
```

## Remarks
Invalid entities may be used as token values. E.g., setting an invalid subentity
 is equivalent to deleting the stored one.